// --створити масив з:
//     - з 5 числових значень
// let numbers = [10,20,30,40,50];
// console.log(numbers);

// - з 5 стічкових значень
// let pages = ['page1','page2','page3','page4','page5'];
// console.log(pages);

// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let xx = [2,true,'1985',false,'tulk']
// console.log(xx)

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr =[];
// arr[0]='Я';
// arr[1] = 'хочу';
// arr[2] = 'навчитись';
// arr[3] = 'програмувати';
// arr[4] = 'з Okten';
// console.log(arr);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 9 ; i++) {
//     document.write(`<div>day z</div>`);
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i <= 9 ; i++) {
//   document.write(`<div> day ${i}</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let x = 0;
// while (x < 20) {
//     document.write(`<div>day z</div>`);
//     x++;
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let x = 0;
// while (x < 20) {
//     document.write(`<div><h1>day ${x}</h1></div>`);
//     x++;
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (const num of nums) {
//     console.log(num);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let pages = ['page1','page2','page3','page4','page5','page6','page7','page8','page9', 'page10'];
// for (const p of pages) {
//     console.log(p);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let xx = [25,'1985',198,'2021','tulk','page6',true,'book',28, false];
// for (const x of xx) {
//     console.log(x);
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let aaa = [225,'2011',18,'2029','hulk','tree',true,'books',95, false];
// for (const a of aaa) {
//     if (typeof a === 'boolean') {
//         console.log(a);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let bbb = [225,'2011',18,'2029','hulk','tree',true,'books',95, false];
// for (const b of bbb) {
//     if (typeof b === 'number') {
//         console.log(b);
//     }
// }
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let ccc = [225,'2011',18,'2029','hulk','tree',true,'books',95, false];
// for (const c of ccc) {
//     if (typeof c === 'string') {
//         console.log(c);
//     }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let all = [];
// all[0] = 20;
// all[1] = 'abra';
// all[2] = false;
// all[3] = 100500;
// all[4] = 'tytan';
// all[5] = '3.14';
// all[6] = 1563;
// all[7] = 'cadabra';
// all[8] = '1900';
// all[9] = true;
// for (let i = 0; i <= 9 ; i++) {
//   console.log(all[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i <= 9 ; i++) {
//     document.write('<p>Поточний крок циклу - ' + i + '; </p>');
//     console.log('Поточний крок циклу - ' + i + '; ');
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i <= 99 ; i++) {
//     document.write('<p>Поточний крок циклу - ' + i + '; </p>');
//     console.log('Поточний крок циклу - ' + i + '; ');
// }
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i <= 99; i += 2) {
//     document.write('<p>Поточний крок циклу - ' + i + '; </p>');
//     console.log('Поточний крок циклу - ' + i + '; ');
// }
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i <= 99; i++) {
//     if(i % 2 === 0){
//         document.write(`<p>Поточний крок циклу (Парні кроки) - ${i}; </p>`);
//         console.log('Поточний крок циклу (Парні кроки) - ' + i + '; ');
//     }
// }
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i <= 99; i++) {
//     if(i % 2 === 1){
//         document.write(`<p>Поточний крок циклу (Не парні кроки) - ${i}; </p>`);
//         console.log('Поточний крок циклу (Не парні кроки) - ' + i + '; ');
//     }
// }