// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка обчислює та повертає площу прямокутника висотою
// let sRectangle = (a, b) => console.log(`Площа прямокутника = ` + (a * b));
// sRectangle(5, 4); // 20

// - створити функцію яка обчислює та повертає площу кола
// let sCircle = (r) => console.log(`Площа кола = ` + 3.14 * r * r);
// sCircle(4); // 50.24

// - створити функцію яка обчислює та повертає площу циліндру
// let sСylinder = (r,h) => console.log(`Площа  циліндра = ` + 2 * 3.14 * r *h);
// sСylinder(4,8); // 200.96

// - створити функцію яка приймає масив та виводить кожен його елемент
// let array = [1, -90, 100500, 2022, 3];
// let fn = array => {
//     for (let i = 0; i < array.length; i++) {
//         console.log(array[i]);
//     }
// }
// fn(array);

// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// let array = (text) => {
//         document.write(`<p>${text}</p>`);
// }
// array(`При реєстрації на сервісі у вас будуть розширені обмеження перевірки, призначені для гостей.`)

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// let array = (text) => {
//         document.write(`<ul>`);
//     document.write(`<li> ${text}</li>`);
//     document.write(`<li> ${text}</li>`);
//     document.write(`<li> ${text}</li>`);
//          document.write(`</ul>`);
// }
// array(`При реєстрації на сервісі у вас будуть розширені обмеження перевірки, призначені для гостей.`);

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// let array = (text,num) => {
//     document.write(`<ul>`);
//     for (let i = 0; i < num; i++) {
//         document.write(`<li> ${text}</li>`);
//     }
//     document.write(`</ul>`);
// }
// array(`При реєстрації на сервісі у вас будуть розширені обмеження перевірки, призначені для гостей.`,5);

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// let array = [1, -90, true, '2022', 3, false, 'hello'];
// let fn = array => {
//     document.write(`<ul>`);
//      for (let i = 0; i < array.length; i++) {
//          document.write(`<li> ${array[i]}</li>`);
//     }
//      document.write(`</ul>`);
//  }
// fn(array);

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// let users = [
//     {id: '1', name: 'Микола', age: 31},
//     {id: '2',name: 'Олег', age: 30},
//     {id: '3',name: 'Ігор', age: 29}
// ];
// let fnUser = users => {
//     for (let user of users) {
//         document.write(`<div> ${user.id}. ${user.name} - вік: ${user.age}</div>`);
//     }
// }
// fnUser(users);